# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

import math

nums = [2, -5, 8, 9, -25, 25, 4]
nums_sqrt = []
for i in nums:
    if i > 0 and math.sqrt(i) % 1 == 0:
        nums_sqrt.append(int(math.sqrt(i)))
print (nums_sqrt)

# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)
days = {
    '01': 'Первое',
    '02': 'Второе',
    '03': 'Третье',
    '04': 'Четвертое',
    '05': 'Пятое',
    '06': 'Шестое',
    '07': 'Седьмое',
    '08': 'Восьмое',
    '09': 'Девятое',
    '10': 'Десятое',
    '11': 'Одинадцатое',
    '12': 'Двенадцатое',
    '13': 'Тринадцатое',
    '14': 'Четырнадцатое',
    '15': 'Пятнадцатое',
    '16': 'Шестнадцатое',
    '17': 'Семнадцатое',
    '18': 'Восемьнадцатое',
    '19': 'Девятнадцатое',
    '20': 'Двадцатое',
    '21': 'Двадцатьпервое',
    '22': 'Двадцатьвторое',
    '23': 'Двадцатьтретье',
    '24': 'Двадцатьчетвертое',
    '25': 'Двадцатьпятое',
    '26': 'Двадцатьшестое',
    '27': 'Двадцатьседьмое',
    '28': 'Двадцатьвосьмое',
    '29': 'Двадцатьдевятое',
    '30': 'Тридцатое',
    '31': 'Тридцатьпервое'
}

months = {
    '01': 'Января',
    '02': 'Февраля',
    '03': 'Марта',
    '04': 'Апреля',
    '05': 'Мая',
    '06': 'Июня',
    '07': 'Июля',
    '08': 'Августа',
    '09': 'Сентября',
    '10': 'Октября',
    '11': 'Ноября',
    '12': 'Декабря'
}

date = '02.11.2013'
date = date.split('.')
print("Сегодня {0} {1} {2} года".format(days[date[0]], months[date[1]], date[2]))

# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

import random

i = 0
rand_num = []
n = int(input("Введите длинну случайной последовательности чисел:"))
while i < n:
    rand_num.append(random.randint(-100, 100))
    i += 1
print (rand_num)

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]


lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst2=[]
lst3=[]
for i in lst:
    if i not in lst2:
        lst2.append(i)
print (lst2)
for i in lst:
    if lst.count(i)<2:
        lst3.append(i)
print (lst3)


