# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

fruits = ["яблоко", "банан", "киви", "арбуз"]
n = 1
indent = len(max(fruits, key=len))
for i in fruits:
    print('{0}.{1:>{2}}'.format(n, i, indent))
    n += 1

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

fruits = ["яблоко", "банан", "киви", "арбуз"]
vegetables = ["яблоко", "помидор", "морковь", "капуста", "перец", "банан", "киви", "арбуз"]
for i in fruits:
    if i in vegetables:
        vegetables.remove(i)
print(vegetables)

# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

nums = [10, 3, 5, 4, 6, 11]
new_nums = []
for i in nums:
    if i % 2 == 0:
        new_nums.append(i / 4)
    else:
        new_nums.append(i * 2)
print(new_nums)
