__author__ = 'Смирнов Сергей Андреевич'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...

while True:
    try:
        number = int(input("Введите целое число"))
    except:
        print ("Введено не целое число! Попробуйте снова.")
        continue
    while number > 0:
        print(number % 10)
        number = number // 10
    break

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a = input("Введите переменную a:")
b = input("Введите переменную b:")
c = a
a = b
b = c
print ("a = " + a + " b = " + b)

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

while True:
    try:
        age=int(input("Введите ваш возраст:"))
    except:
        print("Что то пошле не так. Попробуйте еще раз. Вводите возраст цифрами.")
        continue
    if age>150:
        print ("Люди столько не живут")
        continue
    elif age>18:
        print ('Доступ разрешен')
        break
    else:
        print ("Извините, пользование данным ресурсом только с 18 лет")
        break

